["Wie schon erwähnt ist es eine gute Idee Eigenschaften für die produktiv laufende Software garantieren zu können.\nDoch als gute agile Softwareentwickler wollen wir früh und oft Software ausliefern. Übersetzungen sind häufig auch eine externe Abhängigkeit\naußerhalb des Entwicklungsteams. Um diese Szenario zu behandeln gibt es die Möglichkeit in jeder Übersetzungsdatei eine Fallback Sprache zu deklarieren.\nFehlende Übersetzungen werden dann von der referenzierten Datei gezogen (die selbst wieder auf eine weitere Datei verweisen kann).\nDie einzige Limitation ist dass der Fallback Graph azyklisch sein muss. ","Explizite Fallbacks","Im Fluent Format ist jede Zeile die mit \"#\" beginnt ein Kommentar.\nEine Fallback Sprache kann mit einem Kommentar der Form {H0code|fallback-language: en|} deklariert werden\n(wobei \"en\" die Sprache ist auf die zurückgefallen werden soll).","Da JSON keine Kommentare erlaubt muss die Fallback Sprache in einem top-level Key deklariert werden: \ndem reservierten Key {H0code|\"--fallback-language\"|}.","Im .properties Format ist jede Zeile die mit \"#\" beginnt ein Kommentar.\nEine Fallback Sprache kann mit einem Kommentar der Form {H0code|fallback-language: en|} deklariert werden\n(wobei \"en\" die Sprache ist auf die zurückgefallen werden soll).","Konsistenz","In anderen Lösungen für Internationalisierung sind Übersetzungen oft einfach Key Value Maps.\nUnd wenn es mehrere davon gibt, gibt es keine Checks dass diese die gleichen Keys enthalten.\nHier ist es anders - da wir die Übersetzungen schon zur Compilezeit analyisieren, können wir auch direkt auf Vollständigkeit\nprüfen. Das ist zwar super für die Produktion aber nervig für Entwicklung, besonders bei der Benutzung eines Watch Modes, der\nTravelm-Agency bei jeder Dateiänderung ausführt.\nDie Lösung: Die Flag {H0code|--devMode|} schaltet die Vollständigkeitsprüfung aus und führt zu einem leeren String\nwenn die Übersetzung angefragt wird.","Fehlende Übersetzungen","Die Zeit ist gekommen mit mehreren Input Dateien zu arbeiten! Aber was sind die Konsequenzen?"]