["If you want to insert the same runtime value at multiple locations, just give them the same name.\nFor example, {H0code|\"\\{person\\}, \\{person\\}\"|} will generate a {H0code|I18n -> String -> String|}\nsignature despite the fact that two placeholders have been specified and at runtime, calling the function with {H0code|Evan|} will\nresult in {H0code|Evan, Evan|}","Duplicate interpolation keys","Fluent uses curly bracket syntax with a twist for its interpolation syntax.\nSince you can use the syntax to signal other features as well, the variable you want to interpolate needs to be prefixed with a \"$\".\nIf you want to insert a runtime value in {H0code|\"Hello, !\"|} for the person you want to greet, you could write \n{H0code|\"Hello, \\{$person\\}!\"|} for example. If you want an actual opening curly bracket, use string literals {H0code|\\{ \"...\" \\}|} to escape it.","When you inspect the generated code for the example input, you will notice different type signatures compared to\nthe previous page. Instead of the usual {H0code|I18n -> String|} signature, Travelm-Agency generated a function of type\n{H0code|I18n -> String -> String|} for the {H0code|greeting|} key and a function of type {H0code|I18n -> \\{ day : String, todo : String \\} -> String|}\nfor the {H0code|plan|} key. Looking at their definitions, this makes a lot of sense. The {H0code|greeting|} translation\nstates that it will place one runtime value at the marked location and the {H0code|plan|} translation does so for two.\nAny number of interpolations are supported. Feel free to try it out by adding new interpolations or removing them from the input file.","Generated code","Interpolation","Sometimes, one language needs more or less interpolated values than others, or in a different order.\nTravelm-Agency has no issues with that. You will always need to provide runtime values corresponding to the union of specified\ninterpolation keys across all of your languages, the generated code will then take care of inserting the values in the correct places.","Inconsistent interpolation keys","JSON does not specify a placeholder syntax. We chose the familiar curly bracket syntax:\nIf you want to insert a runtime value in {H0code|\"Hello, !\"|} for the person you want to greet, you could write \n{H0code|\"Hello, \\{person\\}!\"|} for example. If you want an actual opening curly bracket, use backslash to escape it.","This page is about the feature of interpolation: placing a placeholder in a string\nto later replace it with a runtime value.","Properties does not specify a placeholder syntax either. Just like with JSON, we chose curly bracket syntax:\nIf you want to insert a runtime value in {H0code|\"Hello, !\"|} for the person you want to greet, you could write \n{H0code|\"Hello, \\{person\\}!\"|} for example. If you want an actual opening curly bracket, use quotation marks to escape it."]