["Elm's bundle size is generally pretty small, but can get bloated if you have lots of texts in\ndifferent languages on your site. Loading all the inactive languages is a waste most of the time.\nWith Travelm-Agency you can switch from {H0code|inline|} to {H0code|dynamic|} mode with just a command line argument and a few small code changes\nand have your translations loaded on the fly instead. Since the switch is so simple, you can benchmark bundle sizes and load times\nand decide yourself which model suits your application best and possibly switch later. ","Performance","Texts are much more readable in a format like {H0code|.properties|} or {H0code|.json|}.\nDon't get me wrong, texts are also perfectly fine in an Elm file, but when you add in things like interpolation\nand more advanced concepts, readability tends to suffer, while Travelm-Agency can tackle these features at a compiler level.","Readability of translations","The biggest advantage when using Elm over other web solutions is the compile time safety.\nFor internationalisation, that safety often goes out the window for ease of development. Functions for each translation key\nare annoying to write boilerplate code, you either go towards a {H0code|Dict String String|} and/or use some special placeholder syntax\nwhich does not guarantee all placeholders are filled at runtime.\nTravelm-Agency does the annoying boilerplate part for you and makes sure that\n{H2ul|{H1li|All keys are defined in all languages (or have an explicit fallback)|}{H1li|Placeholders and similar concepts get converted to parameters for the respective accessor functions|}|}","Type safety","Advantages over handwritten code","When writing translations in Elm, you have the full power of Elm at your disposal.\nYou can define your own data types, pattern match, define helper functions, all that good stuff.\nWhen using a compiler, you cannot interact on a low level with the code, you are bound to the exposed interface.\nI personally think that is completely fine since Travelm-Agency offers enough \"programmable\" pieces\nlike interpolation, string matching on interpolated values and automatic html generation with overwritable attributes.","Programmability","Frontend development is full of build tools and bundlers, with code generators left and right\n(Elm itself compiles to JS after all). It can be intimidating to add even more tools like this one to the list.\nThe compiler is generally pretty fast and easy to add to your project, feel free to open an issue if you experience any problems.","Build complexity","Disadvantages","Travelm-Agency is a compiler that simplifies working with internationalized texts in the Elm programming language.\nInstead of writing Elm files containing all of your texts for all languages, and writing functions to access the\ncorrect texts depending on the current language, you can write your texts in one of several data formats.\nTravelm-Agency then reads in these files and generates the Elm code you may have otherwise written yourself.","What is Travelm-Agency?","Introduction","Welcome to the Travelm-Agency tutorial. Here, you get to see all the features of Travelm-Agency, presented in examples\nin a playground setting.","It may be weird to call this a feature, but this is the most common translation type that you will need.\nObserve how texts get copied into pattern matching functions for inline mode and into a JSON array for dynamic mode.","Simple texts","This tutorial guides you through the features of Travelm-Agency. On each page will be one or multiple input\nwindows and one or multiple output windows showing you a particular feature with an accompanying explanation. You may edit\nthe text in the input windows and observe how the output files change.","How this tutorial works","You seem to be on a mobile device. While you cannot view text and examples at once,\nyou can scroll over to the right to view example input and output files. "]