["Elms Bundle Größe ist insgesamt relativ klein aber kann schnell wachsen wenn es viele Texte in vielen\nverschiedenen Sprachen auf einer Seite gibt. Die ganzen inaktiven Übersetzungen zu laden ist einen Großteil der Zeit unnötig.\nMit Travelm-Agency kannst du zwischen {H0code|inline|} und {H0code|dynamic|} mode mit nur einem Kommandozeilen Argument \nund nur wenigen Code Anpassungen wechseln, und damit deine Übersetzungen zur Laufzeit nachladen lassen.\nDa die Umstellung so einfach ist, kannst du Bundle Größen benchmarken und Ladezeiten vergleichen um zu entscheiden,\nwelche Lösung für deine Anwendung am besten passt - und möglicherweise später wechseln.","Performanz","Texte sind in einem dafür ausgelegten Format wie {H0code|.properties|} or {H0code|.json|}\nviel lesbarer. Natürlich sind Texte auch in einer Elm Datei völlig in Ordnung, aber wenn Konzepte wie Interpolation ins Spiel kommen\nschadet das oft der Lesbarkeit, während Travelm-Agency diese Probleme auf Compiler Ebene beheben kann.","Lesbarkeit von Übersetzungen","Der größte Vorteil von Elm gegenüber anderen Web Sprachen ist die große Sicherheit zur Compilezeit.\nIm Falle von Internationalisierung geht diese Sicherheit oft verloren für die Einfachheit der Entwicklung.\nFür jede Übersetzung eine eigene Funktion schreiben ist nerviger Boilerplate Code, entweder wechselt man zu einem {H0code|Dict String String|}\nund/oder verwendet eine Platzhalter Syntax die nicht garantiert dass alle notwendigen Parameter auch zur Laufzeit gesetzt sind.\nTravelm-Agency übernimmt den nervigen Boilerplate Teil und stellt sicher dass\n{H2ul|{H1li|Alle Übersetzungen in jeder Sprache definiert sind (oder einen expliziten Fallback haben)|}{H1li|Platzhalter und ähnliche Konzepte zu Parametern der aufrufenden Funktionen werden.|}|}","Typsicherheit","Vorteile gegen über handgeschriebenen Code","Wenn du deine Übersetzungen in Elm schreibst, hast du eine vollständige Programmiersprache\nzur Verfügung. Eigene Datentypen, Pattern matching, Hilfsfunktionen, und so weiter. Mit einem Compiler kann man nicht mehr\nso einfach mit dem Code interagieren und ist stattdessen an das generierte Interface gebunden.\nMeiner Meinung nach ist das vollkommen ok, da Travelm-Agency genug \"programmierbare\" Teile bietet,\nwie Interpolation, Matchen auf interpolierten Werten und automatische Html Generierung mit überschreibbaren Attributen.","Programmierbarkeit","Frontend Entwicklung ist voll von Build Tools, Bundlers, Code Generatoren überall.\nElm selbst kompiliert schließlich zu JS. Es kann einschüchternd sein noch mehr Tools wie dieses hier zu seiner Liste hinzuzufügen.\nDer Compiler ist verhältnismäßig schnell und einfach zum Projekt hinzuzufügen, falls Probleme auftreten gerne ein Issue erstellen.","Build Komplexität","Nachteile","Travelm-Agency ist ein Compiler der die Arbeit mit internationalisierten Texten in der Programmiersprache Elm\nerleichtert. Anstatt Elm Dateien zu schreiben die alle Texte einer Sprache beinhalten mit Funktionen die abhängig von der aktuellen Sprache\nden korrekten Text zurückgeben, kannst du auch Texte in einem von mehreren unterstützten Datenformaten schreiben.\nTravelm-Agency liest dann diese Dateien ein und generiert den passenden Elm Code für dich.","Was ist Travelm-Agency?","Einführung","Willkommen zum Travelm-Agency Tutorial. Die folgenden Seiten sind Dokumentation und Einführung in Travelm-Agency in einem interaktiven Playground.","Es klingt vielleicht merkwürdig dies ein Feature zu nennen aber dies ist der meistgenutzte Übersetzungstyp.\nBeobachte wie Texte in Pattern Matching Funktionen für Inline Mode kopiert werden und in ein JSON Array für Dynamic Mode.","Einfache Texte","Dieses Tutorial führt dich durch die Features von Travelm-Agency. Auf jeder Seite werden ein oder mehrere\nEingabefenster und ein oder mehrere Ausgabefenster sichtbar sein, die dir ein bestimmtes Feature zeigen, mit einem zugehörigen Erklärungstext.\nDu kannst den Text in den Eingabefenstern verändern und beobachten wie sich die Ausgabe verändert.","Wie das Tutorial funktioniert","Du scheinst auf einem Mobilgerät zu sein. Obwohl du nicht gleichzeitig Text und Beispiele sehen kannst,\nsolltest du nach rechts scrollen können und die Eingabe- und Ausgabefenster zu sehen."]